<a href="https://colab.research.google.com/github/sdazz56/Data-Science-Projects/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [18]:
columns=['Eleanor','James','Rio','Maria']
data_f=np.random.randint(low=0,high=101,size=(3,4))
data_f

array([[61,  1, 46, 83],
       [21, 49, 99, 40],
       [34, 76, 26, 73]])

In [19]:
data=pd.DataFrame(data=data_f,columns=columns)
data

   Eleanor  James  Rio  Maria
0       61      1   46     83
1       21     49   99     40
2       34     76   26     73

In [21]:
data['Eleanor'][0]

61

In [22]:
data['Janet']=data['Rio']+data['Maria']
data

   Eleanor  James  Rio  Maria  Janet
0       61      1   46     83    129
1       21     49   99     40    139
2       34     76   26     73     99